etp-backend/src/main/resources/suomifi/viesti.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:asi="http://www.suomi.fi/asiointitili">
    <soapenv:Header/>
    <soapenv:Body>
        <asi:LahetaViesti xmlns:asi="http://www.suomi.fi/asiointitili">
            <asi:Viranomainen>
                {{#viranomainen}}
                <asi:ViranomaisTunnus>{{viranomaistunnus}}</asi:ViranomaisTunnus>
                <asi:PalveluTunnus>{{palvelutunnus}}</asi:PalveluTunnus>
                {{#yhteyshenkilo}}<asi:Yhteyshenkilo Nimi="{{nimi}}" Sahkoposti="{{email}}" />{{/yhteyshenkilo}}
                {{/viranomainen}}
                {{#sanoma}}
                <asi:SanomaTunniste>{{tunniste}}</asi:SanomaTunniste>
                <asi:SanomaVersio>{{versio}}</asi:SanomaVersio>
                <asi:SanomaVarmenneNimi>{{varmenne}}</asi:SanomaVarmenneNimi>
                {{/sanoma}}
            </asi:Viranomainen>
            {{#kysely}}
            <asi:Kysely>
                <asi:Paperi>{{paperitoimitus?}}</asi:Paperi>
                <asi:Kohteet>
                    {{#kohteet}}
                    <asi:Kohde>
                        {{#asiakas}}
                        <asi:Asiakas AsiakasTunnus="{{tunnus}}" TunnusTyyppi="{{tyyppi}}">
                            {{#osoite}}
                            <asi:Osoite>
                                <asi:Nimi>{{nimi}}</asi:Nimi>
                                <asi:Lahiosoite>{{lahiosoite}}</asi:Lahiosoite>
                                <asi:Postinumero>{{postinumero}}</asi:Postinumero>
                                <asi:Postitoimipaikka>{{postitoimipaikka}}</asi:Postitoimipaikka>
                                <asi:Maa>{{maa}}</asi:Maa>
                            </asi:Osoite>
                            {{/osoite}}
                        </asi:Asiakas>
                        {{/asiakas}}
                        <asi:ViranomaisTunniste>{{viranomaistunniste}}</asi:ViranomaisTunniste>
                        <asi:Nimeke>{{nimike}}</asi:Nimeke>
                        <asi:LahetysPvm>{{lahetys-pvm}}</asi:LahetysPvm>
                        <asi:KuvausTeksti>{{kuvaus-teksti}}</asi:KuvausTeksti>
                        <asi:Tiedostot>
                            {{#tiedostot}}
                            <asi:Tiedosto>
                                <asi:TiedostonKuvaus>{{kuvaus}}</asi:TiedostonKuvaus>
                                <asi:TiedostoSisalto>{{sisalto}}</asi:TiedostoSisalto>
                                <asi:TiedostoMuoto>{{muoto}}</asi:TiedostoMuoto>
                                <asi:TiedostoNimi>{{nimi}}</asi:TiedostoNimi>
                            </asi:Tiedosto>
                            {{/tiedostot}}
                        </asi:Tiedostot>
                    </asi:Kohde>
                    {{/kohteet}}
                </asi:Kohteet>
                <asi:Tulostustoimittaja>{{tulostustoimittaja}}</asi:Tulostustoimittaja>
                <asi:LahetaTulostukseen>{{laheta-tulostukseen?}}</asi:LahetaTulostukseen>
                {{#laskutus}}
                <asi:Laskutus>
                    <asi:Tunniste>{{tunniste}}</asi:Tunniste>
                    <asi:Salasana>{{salasana}}</asi:Salasana>
                </asi:Laskutus>
                {{/laskutus}}
            </asi:Kysely>
            {{/kysely}}
        </asi:LahetaViesti>
    </soapenv:Body>
</soapenv:Envelope>